src/Documents/кфкВерсияСпецификации/кфкВерсияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кфкВерсияСпецификации</name>
  <registerRecords>InformationRegister.кфкВерсииСпецификации</registerRecords>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополняющаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>DefinedType.кфкКомпонентСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/кфкВерсииСпецификации/кфкВерсииСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкВерсииСпецификации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополняющаяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияИсправления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/кфкВерсияСпецификации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр кфкВерсииСпецификации
	Движения.кфкВерсииСпецификации.Записывать = Истина;
	Движение = Движения.кфкВерсииСпецификации.Добавить();
	Движение.Период = Дата;
	Движение.Спецификация = Спецификация;
	Движение.ОсновнаяВерсия = ОсновнаяВерсия;
	Движение.ДополняющаяВерсия = ДополняющаяВерсия;
	Движение.ВерсияИсправления = ВерсияИсправления;
	Движение.Версия = СтрШаблон("%1.%2.%3", ОсновнаяВерсия, ДополняющаяВерсия, ВерсияИсправления);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
